In [6]:
import pandas as pd
import numpy as np

s = pd.Series(['Ali','HasSan  ','Bilal',np.nan,'Malik'])
s

0         Ali
1    HasSan
2       Bilal
3         NaN
4       Malik
dtype: object

In [2]:
s.str.lower()

0            ali
1    hassan bahi
2          bilal
3            NaN
4          malik
dtype: object

In [3]:
s.str.upper()

0            ALI
1    HASSAN BAHI
2          BILAL
3            NaN
4          MALIK
dtype: object

In [4]:
s.str.len()
#len(s)

0     3.0
1    11.0
2     5.0
3     NaN
4     5.0
dtype: float64

In [7]:
s.str.strip()

0       Ali
1    HasSan
2     Bilal
3       NaN
4     Malik
dtype: object

In [8]:
s.str.split("a")

0           [Ali]
1    [H, sS, n  ]
2        [Bil, l]
3             NaN
4        [M, lik]
dtype: object

In [10]:
s.str.cat(sep=',')

'Ali,HasSan  ,Bilal,Malik'

In [11]:
s1 = pd.Series(['Male','Female'])
s1

0      Male
1    Female
dtype: object

In [14]:
s1.str.get_dummies()

   Female  Male
0       0     1
1       1     0

In [15]:
s.str.get_dummies()

   Ali  Bilal  HasSan    Malik
0    1      0         0      0
1    0      0         1      0
2    0      1         0      0
3    0      0         0      0
4    0      0         0      1

In [16]:
s.str.contains('Malik')

0    False
1    False
2    False
3      NaN
4     True
dtype: object

In [21]:
s.str.replace('s','x')

0         Ali
1    HaxSan
2       Bilal
3         NaN
4       Malik
dtype: object

In [22]:
s.str.count('a')

0    0.0
1    2.0
2    1.0
3    NaN
4    1.0
dtype: float64

In [23]:
s.str.startswith('Ha')

0    False
1     True
2    False
3      NaN
4    False
dtype: object

In [24]:
s.str.endswith('al')

0    False
1    False
2     True
3      NaN
4    False
dtype: object

In [27]:
s.str.find('lal')
#"-1" indicates that there no such pattern available in the element.
# and other are the starting index

0   -1.0
1   -1.0
2    2.0
3    NaN
4   -1.0
dtype: float64

In [28]:
s.str.findall('lal')

0       []
1       []
2    [lal]
3      NaN
4       []
dtype: object

In [29]:
s.str.swapcase()

0         aLI
1    hASsAN
2       bILAL
3         NaN
4       mALIK
dtype: object

In [32]:
s2 = pd.Series(['ALI',"ali","aLi"])
s2.str.islower()

0    False
1     True
2    False
dtype: bool

In [34]:
s2.str.isupper()

0     True
1    False
2    False
dtype: bool

In [36]:
s2.str.isnumeric()

0    False
1    False
2    False
dtype: bool